resume.org
#+title: Isaiah Sherfick Resume

* Contact
email: isaiahsherfick8@gmail.com
github: isaiahsherfick
website: isaiahsherfick.com
* Experience
** Epic Systems Corporation - Software Developer
- July 2022 - Current
- Maintained and enhanced clinical cardiology documentation software
- Effectively utilized modern debugging solutions to fix operation-critical bugs
- Leveraged modern software design patterns like MVVC with C#, TS, JS, React, Python, SQL, and MUMPS code
- Selected as a version control power user to assist other developers during our migration from SVN to git
- Independently managed and completed projects from concept to production
- Ran daily standups and triaged issues to squash bugs
- Contributed to team growth by mentoring a new hire
- Traveled on-site to customer health systems to shadow end users
- Improved launch times by 20% with performance-oriented refactoring
* Education
- Indiana University - Bloomington
- Fall 2017 - Spring 2022
- Computer Science MS + BS
- Undergraduate specialization: Software Engineering
- Minor: Music Studies
- Relevant Coursework: Software Engineering, Object-Oriented Software Design, Applied Algorithms, Applied Machine Learning, Operating Systems, Distributed Systems, Computer Networks, Computer Structures, Advanced Database Concepts
* Projects
** Open Ear Trainer
- https://www.github.com/isaiahsherfick/OpenEarTrainer
- Open source, cross platform ear training app for musicians
- Collaborated with local developers and oversaw the project
- Designed my own music theory data model which allows us to construct chords and intervals in a modular, well-abstracted way
** Codebase Insights
- Led a team of 6 for a whole semester in grad school
- VSCode extension to monitor the health of your codebase
- Used metadata from git, Jenkins, SonarQube, and Bamboo to create visualizations
- Color-coded heat map of project files to view "brittleness"
- Parsed build stack traces to determine how often filenames appear in crashes
* Open Source Contributions
** World of Warcraft - Hardcore addon
- Contributed a feature to the most popular (at the time) WoW addon
- Added a checkbox to mute a notification sound for a toast popup
- https://github.com/Zarant/WoW_Hardcore/commit/8f105d5013397ef41b4a867f9d39fb5be226240a
* Skills
** Programming Languages
Happy to work in any language, even if I've never seen it before.
Most comfortable with: C, Python, C#, JS/TS, Rust, SQL, Assembly, R, C++, Java
** Platforms
Linux, Windows, Mac (in that order)
** Certifications
Actively pursuing CompTIA Network+, CompTIA Security+, and CCNA
