resume.tex
% Created 2023-12-28 Thu 13:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Isaiah}
\date{\today}
\title{Isaiah Sherfick Resume}
\hypersetup{
 pdfauthor={Isaiah},
 pdftitle={Isaiah Sherfick Resume},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Contact}
\label{sec:org80c39f9}
email: isaiahsherfick8@gmail.com
github: isaiahsherfick
website: isaiahsherfick.com
\section{Experience}
\label{sec:org1af89ef}
\subsection{Epic Systems Corporation - Software Developer}
\label{sec:org43a5bc1}
\begin{itemize}
\item July 2022 - Current
\item Maintained and enhanced clinical cardiology documentation software
\item Effectively utilized modern debugging solutions to fix operation-critical bugs
\item Leveraged modern software design patterns like MVVC with C\#, TS, JS, React, Python, SQL, and MUMPS code
\item Selected as a version control power user to assist other developers during our migration from SVN to git
\item Independently managed and completed projects from concept to production
\item Ran daily standups and triaged issues to squash bugs
\item Contributed to team growth by mentoring a new hire
\item Traveled on-site to customer health systems to shadow end users
\item Improved launch times by 20\% with performance-oriented refactoring
\end{itemize}
\section{Education}
\label{sec:orga08435d}
\begin{itemize}
\item Indiana University - Bloomington
\item Fall 2017 - Spring 2022
\item Computer Science MS + BS
\item Undergraduate specialization: Software Engineering
\item Minor: Music Studies
\item Relevant Coursework: Software Engineering, Object-Oriented Software Design, Applied Algorithms, Applied Machine Learning, Operating Systems, Distributed Systems, Computer Networks, Computer Structures, Advanced Database Concepts
\end{itemize}
\section{Projects}
\label{sec:org495d51e}
\subsection{Open Ear Trainer}
\label{sec:org0f45c71}
\begin{itemize}
\item \url{https://www.github.com/isaiahsherfick/OpenEarTrainer}
\item Open source, cross platform ear training app for musicians
\item Collaborated with local developers and oversaw the project
\item Designed my own music theory data model which allows us to construct chords and intervals in a modular, well-abstracted way
\end{itemize}
\subsection{Codebase Insights}
\label{sec:org995f960}
\begin{itemize}
\item Led a team of 6 for a whole semester in grad school
\item VSCode extension to monitor the health of your codebase
\item Used metadata from git, Jenkins, SonarQube, and Bamboo to create visualizations
\item Color-coded heat map of project files to view ``brittleness''
\item Parsed build stack traces to determine how often filenames appear in crashes
\end{itemize}
\section{Open Source Contributions}
\label{sec:orga926993}
\subsection{World of Warcraft - Hardcore addon}
\label{sec:orgac7e02a}
\begin{itemize}
\item Contributed a feature to the most popular (at the time) WoW addon
\item Added a checkbox to mute a notification sound for a toast popup
\item \url{https://github.com/Zarant/WoW\_Hardcore/commit/8f105d5013397ef41b4a867f9d39fb5be226240a}
\end{itemize}
\section{Skills}
\label{sec:org466ae48}
\subsection{Programming Languages}
\label{sec:org7fba5ee}
Happy to work in any language, even if I've never seen it before.
Most comfortable with: C, Python, C\#, JS/TS, Rust, SQL, Assembly, R, C++, Java
\subsection{Platforms}
\label{sec:orga78fdfe}
Linux, Windows, Mac (in that order)
\subsection{Certifications}
\label{sec:org856fba5}
Actively pursuing CompTIA Network+, CompTIA Security+, and CCNA
\end{document}
